# Lab 01
## Getting Started with Transact SQL
### Explore the AdventureWorks database

We’ll use the AdventureWorksLT database in this lab, so let’s start by exploring it in Azure Data Studio.

1. Start Azure Data Studio, and in the Connections tab, select the AdventureWorksLT connection by clicking on the arrow just to the left of the name. This will connect to the SQL Server instance and show the objects in the AdventureWorks database.
2. Expand the Tables folder to see the tables that are defined in the database. Note that there are a few tables in the dbo schema, but most of the tables are defined in a schema named SalesLT.
3. Expand the SalesLT.Product table and then expand its Columns folder to see the columns in this table. Each column has a name, a data type, an indication of whether it can contain _null_ values, and in some cases an indication that the columns is used as a primary key (PK) or foreign key (FK).
4. Right-click the SalesLT.Product table and use the SELECT TOP (1000) option to create and run a new query script that retrieves the first 1000 rows from the table.
5. Review the query results, which consist of 1000 rows - each row representing a product that is sold by the fictitious _Adventure Works Cycles_ company.
6. Close the SQLQuery\_1 pane that contains the query and its results.
7. Explore the other tables in the database, which contain information about product details, customers, and sales orders. The tables are related through primary and foreign keys, as shown here (you may need to resize the pane to see them clearly):

![](https://microsoftlearning.github.io/dp-080-Transact-SQL/Instructions/Labs/images/adventureworks-erd.png)

- Open Azure Data Studio application
- Open Lab-01.ipynb notebook
- Attach to AdventureWorksLT database
- Follow instructions to perform T-SQL queries

## Use SELECT queries to retrieve data

* * *

Now that you’ve had a chance to explore the AdventureWorks database, it’s time to dig a little deeper into the product data it contains by querying the Product table.

1. In the **Kerne**l drop down ensure that _SQL_ is selected
2. In the **Attach to** drop down ensure that you _Change Connection_ to AdventureWorks database.
3. Write a query in the code cell below to **_return all columns and all rows from the Product table_**.
4. Run the code cell to run the query, and and after a few seconds, review the results, which includes all columns for all products.

5. Copy the query above and modify to _**only return the Product Name, Standard Cost, and List Price from the Product table**_.
6. Run the code cell to run the query, and review the results, review the results, which this time include only the Name, StandardCost, and ListPrice columns for all products.

7. Copy the query above and modify the query to subtract Standard Cost from List Price that results in a calculated column, and then re-run the query
8. Note that the results this time include the Name column and an unnamed column containing the result of subtracting the StandardCost from the ListPrice.


9. Modify the query using the **AS** keyword to assign columns names **ProductName** and **Markup** in the results, and then re-run the query.'
10. Note that the results now include columns named ProductName and Markup.

11. Write a query to return the Product Number, Color, Size, plus the Color Size separated by a comma named ProductDetails. ***Hint*** use the Plus Sign (+) to concatenate the Color and Size columns.

* * *
## Working with data types
As you just saw, columns in a table are defined as specific data types, which affects the operations you can perform on them.

1.  Enter the following query and execute.
```
SELECT ProductID + ': ' + Name AS ProductName
FROM SalesLT.Product; 
```
2. Note that this query returns an error. The + operator can be used to concatenate text-based values, or add numeric values; but in this case there’s one numeric value (ProductID) and one text-based value (Name), so it’s unclear how the operator should be applied.

In [ ]:

FROM SalesLT.Product;

3. Modify the query using the **CAST** function to convert the Product ID to a varchar(5), and run the query.
4. Note that the effect of the **CAST** function is to change the numeric ProductID column into a varchar (variable-length character data) value that can be concatenated with other text-based values.

5. Modify the query to replace the **CAST** function with a **CONVERT** function as shown below, and then re-run it
6. Note that the results of using **CONVERT** are the same as for CAST. The **CAST** function is an ANSI standard part of the SQL language that is available in most database systems, while **CONVERT** is a SQL Server specific function.

7. Another key difference between the two functions is that **CONVERT** includes an additional parameter that can be useful for formatting date and time values when converting them to text-based data. For example, replace the existing query with the following code and run it.

```
 SELECT SellStartDate,
    CONVERT(nvarchar(30), SellStartDate) AS ConvertedDate,
     CONVERT(nvarchar(30), SellStartDate, 126) AS ISO8601FormatDate
 FROM SalesLT.Product; 
```

8. Replace the existing query with the following code, and run it.

```
SELECT Name, CAST(Size AS Integer) AS NumericSize
FROM SalesLT.Product; 
```

9. Note that an error is returned because some Size values are not numeric (for example, some item sizes are indicated as S, M, or L).

10. Modify the query replacing **CAST** with **TRY\_CAST** function, and re-run the query.
11. Note that the numeric Size values are converted successfully to integers, but that non-numeric sizes are returned as NULL.

* * *

## Handle NULL values

We’ve seen some examples of queries that return NULL values. NULL is generally used to denote a value that is unknown. Note that this is not the same as saying the value is none - that would imply that you know that the value is zero or an empty string!

1. Modify the previous query and use the **ISNULL** and **TRY\_CAST** functions to return a zero instead of a NULL value. _**Syntax:**_

```
 ISNULL(TRY_CAST(column_name AS data_type),0)

```

2. Run the query and view the results. Note that the **ISNULL** function replaces NULL values with the specified value, so in this case, sizes that are not numeric (and therefore can’t be converted to integers) are returned as 0.

In this example, the **ISNULL** function is applied to the output of the inner **TRY\_CAST** function, but you can also use it to deal with NULL values in the source table.

3. Replace the query with the **ISNULL** function to handle NULL values for Color and Size values in the source table replacing with a empty string.

The **ISNULL** function replaces NULL values with a specified literal value. Sometimes, you may want to achieve the opposite result by replacing an explicit value with NULL. To do this, you can use the **NULLLIF* function.

4. Try the following query, which replaces the Color value “Multi” to NULL.
```
SELECT Name, NULLIF(Color, 'Multi') AS SingleColor
FROM SalesLT.Product;
```

In some scenarios, you might want to compare multiple columns and find the first one that isn’t NULL. For example, suppose you want to track the status of a product’s availability based on the dates recorded when it was first offered for sale or removed from sale. A product that is currently available will have a SellStartDate, but the SellEndDate value will be NULL. When a product is no longer sold, a date is entered in its SellEndDate column. To find the first non-NULL column, you can use the **COALESCE** function.

5. Use the following query to find the first non-NULL date for product selling status.

```
SELECT Name, COALESCE(SellEndDate, SellStartDate) AS StatusLastUpdated
FROM SalesLT.Product;
```

The previous query returns the last date on which the product selling status was updated, but doesn’t actually tell us the sales status itself. To determine that, we’ll need to check the dates to see if the ***SellEndDate*** is NULL. To do this, you can use a **CASE** expression in the SELECT clause to check for NULL ***SellEndDate*** values. The **CASE** expression has two variants: a simple **CASE** what evaluates a specific column or value, or a searched **CASE** that evaluates one or more expressions.

In this example, or **CASE** experssion must determine if the ***SellEndDate*** column is NULL. Typically, when you are trying to check the value of a column you can use the = operator; for example the predicate ***SellEndDate*** = ‘01/01/2005’ returns True if the ***SellEndDate*** value is 01/01/2005, and False otherwise. However, when dealing with NULL values, the default behavior may not be what you expect. Remember that NULL actually means unknown, so using the = operator to compare two unknown values always results in a value of NULL - semantically, it’s impossible to know if one unknown value is the same as another. To check to see if a value is NULL, you must use the IS NULL predicate; and conversely to check that a value is not NULL you can use the IS NOT NULL predicate.

6. Use the following query, which includes searched **CASE** that uses an IS NULL expression to check for NULL SellEndDate values.

```
 SELECT Name,
     CASE
         WHEN SellEndDate IS NULL THEN 'Currently for sale'
         ELSE 'No longer available'
     END AS SalesStatus
 FROM SalesLT.Product;
```

The previous query used a searched **CASE** expression, which begins with a **CASE** keyword, and includes one or more WHEN…THEN expressions with the values and predicates to be checked. An ELSE expression provides a value to use if none of the WHEN conditions are matched, and the END keyword denotes the end of the **CASE** expression, which is aliased to a column name for the result using an AS expression.

In some queries, it’s more appropriate to use a simple **CASE** expression that applies multiple WHERE…THEN predictes to the same value.

7. Run the following query to see an example of a simple **CASE** expression that produced different results depending on the ***Size*** column value.

```
 SELECT Name,
     CASE Size
         WHEN 'S' THEN 'Small'
         WHEN 'M' THEN 'Medium'
         WHEN 'L' THEN 'Large'
         WHEN 'XL' THEN 'Extra-Large'
         ELSE ISNULL(Size, 'n/a')
     END AS ProductSize
 FROM SalesLT.Product;
```
8. Review the query results and note that the **ProductSize** column contains the text-based description of the size for S, M, L, and XL sizes; the measurement value for numeric sizes, and n/a for any other sizes values.

## End of Lab 01